package com.example.nplus1test.testFiles;

public class Subway {

    // 서브웨이 주문 업무 분석
    // 1. 메뉴 선택 -> 어떤 유형의 샌드위치를 시킬 것인가? (총 칼로리, 패티 종류, )
    // 선택지 : 섭픽 = 자동메뉴 완성형 / 메뉴 내 어울리는 조합을 선택해달라 =>
    // 2. 빵 길이 선택하기
    // 2. 빵 선택 버거를 어떻게 만드느냐?
    // 3. 치즈 선택 : 선호하는 치즈
    // 4. 추가 메뉴 선택 : 에그나 기타 안에 들어가는거 필요하세요?
    // 5. 야채 선택 : 어떤 야채를 좋아하나? => 알레르기 여부 체크
    // 6. 소스 선택 : 어떤 소스 => 매움 여부
    // 7. 쿠키, 수프, 감자칩 등 선택 => 단품 또는 세트 선택여부
    // 8. 매장 이용 여부 => 매장 : 트라이, 플라스틱 컵 / 포장 : 포장지, 일회용 컵
    // 9. 결제하기 (카드, 현금) -> 결제 유형 선택

    // 본사와 지사가 나눠져있다 (확장은 ㄴㄴ)

    // 서브웨이 -> 메뉴 / 메뉴 내에 재료 선택 -> 세트 -> 결제
    // 엔터티 만들기
    // dto 만들기 (정적)
    // dto를 이용한 행위 만들기 (동적)





}
